target/test-classes/xml/selfcare/changebundle/TC31938_B07_createOrder

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <ord1:createOrder type="NEW" xsi:schemaLocation="http://order.telco.hsntech.com ShopFront.xsd" xmlns:ord1="http://order.telco.hsntech.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <account type="RESIDENTIAL">
                <contact type="BILLING" language="en_GB">
                    <title>Mr</title>
                    <firstName></firstName>
                    <lastName></lastName>
                    <telephoneNumbers defaultContact="daytime">
                        <daytime>0398403850</daytime>
                        <evening>0208619999</evening>
                        <mobile>02086999990</mobile>
                    </telephoneNumbers>
                    <emailAddress></emailAddress>
                    <birthDate>1975-01-01</birthDate>
                </contact>
                <billingAddress>
                    <buildingIdentifier>30</buildingIdentifier>
                    <addressLine1>LUKIN STREET</addressLine1>
                    <!--<addressLine2>Address Line 2</addressLine2>:-->
                    <town>LONDON</town>
                    <country>United Kingdom</country>
                    <postcode>E10AA</postcode>
                    <ptc_abs_code>PTCABS23599440</ptc_abs_code>
                    <startDate>1980-08-08</startDate>
                </billingAddress>
                <accountDetail>
                    <username></username>
                    <password>password1</password>
                    <securityQuestion>Mothers maiden name?</securityQuestion>
                    <securityAnswer>smith</securityAnswer>
                </accountDetail>
                <billingDetail>
                    <billGroupId>422</billGroupId>
                    <preferredNotification>SMS</preferredNotification>
                    <paymentDetail type="CARD">
                        <creditCard>
                            <cardName>Card</cardName>
                            <cardNumber>5105105105105100</cardNumber>
                            <cardType>MC</cardType>
                            <cardExpiryDate>0130</cardExpiryDate>
                            <cvv>123</cvv>
                        </creditCard>
                    </paymentDetail>
                    <billFormat>SUMMARY</billFormat>
                    <clubcardNumber>634143330730912784</clubcardNumber>
                </billingDetail>
            </account>
            <verification runCreditCheck="false" termsAndConditionsAccepted="true" refundableDepositAccepted="false">
                <interconnect>
                    <param name="PAYASYOUGO"/>
                </interconnect>
            </verification>
            <orderDetail orderRef="12345" ipAddress="160.206.234.22" salesChannel="Onlines" externalSystemID="COCO" devicePrint="DEVICEPRINT-AA" paymentMethod="CARD">
                <dateTime>2011-06-10T16:44:31.0Z</dateTime>
                <!--1 or more repetitions:-->
                <orderItem id="1" dealSKU="DEAL-INHAND" masterSubscription="true">
                    <serviceRef reference="FC MPN"/>
                    <!--You have a CHOICE of the next 4 items at this level-->
                    <tariff productCode="FC12-1000-500SO">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </tariff>
                    <device productCode="HTC-WILDFIRE-XXX-60">
                        <deliveryMethod>DELIVER</deliveryMethod>
                        <unitCharge>99</unitCharge>
                        <imei>359090017074582</imei>
                        <serialNumber>123152436451568486784684</serialNumber>
                    </device>
                    <discBundle productCode="00500-SB-A" bundleGroup="SB-GRP-A">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </discBundle>
                    <discBundle productCode="1GB-4GDATA-0750-FC" bundleGroup="STD4GDATA">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </discBundle>
                </orderItem>
                <paymentRequest>
                    <cardName>Card</cardName>
                    <cardNumber>5105105105105100</cardNumber>
                    <cardType>MC</cardType>
                    <cardExpiryDate>0130</cardExpiryDate>
                    <cvv>123</cvv>
                </paymentRequest>
            </orderDetail>
        </ord1:createOrder>
    </soapenv:Body>
</soapenv:Envelope>